RIOT-OS/RIOT/cpu/efm32gg/emlib/inc/em_lesense.h
  /** Select PRS channel input for bit 3 of the LESENSE decoder. */
  LESENSE_PRSSel_TypeDef   prsChSel3;
} LESENSE_DecCtrlDesc_TypeDef;

/** Default configuration for LESENSE_PerCtrl_TypeDef structure. */
#define LESENSE_DECCTRL_DESC_DEFAULT \
  {                                  \
    lesenseDecInputSensorSt, /**/    \
    0U,                      /**/    \
    false,                   /**/    \
    true,                    /**/    \
    true,                    /**/    \
    true,                    /**/    \
    true,                    /**/    \
    true,                    /**/    \
    false,                   /**/    \
    lesensePRSCh0,           /**/    \
    lesensePRSCh1,           /**/    \
    lesensePRSCh2,           /**/    \
    lesensePRSCh3,           /**/    \
  }


/** LESENSE module initialization structure. */
typedef struct
{
  /** LESENSE core configuration parameters. */
  LESENSE_CoreCtrlDesc_TypeDef coreCtrl;

  /** LESENSE timing configuration parameters. */
  LESENSE_TimeCtrlDesc_TypeDef timeCtrl;

  /** LESENSE peripheral configuration parameters. */
  LESENSE_PerCtrlDesc_TypeDef  perCtrl;

  /** LESENSE decoder configuration parameters. */
  LESENSE_DecCtrlDesc_TypeDef  decCtrl;
} LESENSE_Init_TypeDef;

/** Default configuration for LESENSE_Init_TypeDef structure. */
#define LESENSE_INIT_DEFAULT                        \
  {                                                 \
    .coreCtrl = LESENSE_CORECTRL_DESC_DEFAULT, /* Default core control parameters. */ \
    .timeCtrl = LESENSE_TIMECTRL_DESC_DEFAULT, /* Default time control parameters. */ \
    .perCtrl  = LESENSE_PERCTRL_DESC_DEFAULT,  /* Default peripheral control parameters. */ \
    .decCtrl  = LESENSE_DECCTRL_DESC_DEFAULT   /* Default decoder control parameters. */ \
  }


/** Channel descriptor structure. */
typedef struct
{
  /** Set to enable scan channel CHx. */
  bool                          enaScanCh;

  /** Set to enable CHx pin. */
  bool                          enaPin;

  /** Enable/disable channel interrupts after configuring all the sensor channel
   *  parameters. */
  bool                          enaInt;

  /** Configure channel pin mode for the excitation phase of the scan sequence.
   *  Note: OPAOUT is only available on channels 2, 3, 4, and 5. */
  LESENSE_ChPinExMode_TypeDef   chPinExMode;

  /** Configure channel pin idle setup in LESENSE idle phase. */
  LESENSE_ChPinIdleMode_TypeDef chPinIdleMode;

  /** Set to use alternate excite pin for excitation. */
  bool                          useAltEx;

  /** Set to enable the result from this channel being shifted into the decoder
   *  register. */
  bool                          shiftRes;

  /** Set to invert the result bit stored in SCANRES register. */
  bool                          invRes;

  /** Set to store the counter value in RAM (accessible via RESDATA) and make
   *  the comparison result available in the SCANRES register. */
  bool                          storeCntRes;

  /** Select clock used for excitation timing. */
  LESENSE_ChClk_TypeDef         exClk;

  /** Select clock used for sample delay timing. */
  LESENSE_ChClk_TypeDef         sampleClk;

  /** Configure excitation time. Excitation will last exTime+1 excitation clock
   *  cycles. Valid range: 0-63 (6 bits). */
  uint8_t                       exTime;

  /** Configure sample delay. Sampling will occur after sampleDelay+1 sample
   *  clock cycles. Valid range: 0-127 (7 bits). */
  uint8_t                       sampleDelay;

  /** Configure measure delay. Sensor measuring is delayed for measDelay
   *  excitation clock cycles. Valid range: 0-127 (7 bits). */
  uint8_t                       measDelay;

  /** Configure ACMP threshold.
   *  If perCtrl.dacCh0Data or perCtrl.dacCh1Data is set to #lesenseDACIfData,
   *  acmpThres defines the 12-bit DAC data in the corresponding data register
   *  of the DAC interface (DACn_CH0DATA and DACn_CH1DATA).
   *  In this case, the valid range is: 0-4095 (12 bits).
   *  If perCtrl.dacCh0Data or perCtrl.dacCh1Data is set to #lesenseACMPThres,
   *  acmpThres defines the 6-bit Vdd scaling factor of ACMP negative input
   *  (VDDLEVEL in ACMP_INPUTSEL register).
   *  In this case, the valid range is: 0-63 (6 bits). */
  uint16_t                     acmpThres;

  /** Select if ACMP output or counter output should be used in comparison. */
  LESENSE_ChSampleMode_TypeDef sampleMode;

  /** Configure interrupt generation mode for CHx interrupt flag. */
  LESENSE_ChIntMode_TypeDef    intMode;

  /** Configure decision threshold for counter comparison.
   *  Valid range: 0-65535 (16 bits). */
  uint16_t                     cntThres;

  /** Select mode for counter comparison. */
  LESENSE_ChCompMode_TypeDef   compMode;
} LESENSE_ChDesc_TypeDef;


/** Configuration structure for all scan channels. */
typedef struct
{
  /** Channel descriptor for all 16 channels. */
  LESENSE_ChDesc_TypeDef Ch[16];
} LESENSE_ChAll_TypeDef;

/** Default configuration for scan channel. */
#define LESENSE_CH_CONF_DEFAULT                                                                       \
  {                                                                                                   \
    true,                  /* Enable scan channel. */                                                 \
    true,                  /* Enable the assigned pin on scan channel. */                             \
    true,                  /* Enable interrupts on channel. */                                        \
    lesenseChPinExHigh,    /* Channel pin is high during the excitation period. */                    \
    lesenseChPinIdleLow,   /* Channel pin is low during the idle period. */                           \
    false,                 /* Don't use alternate excitation pins for excitation. */                  \
    false,                 /* Disabled to shift results from this channel to the decoder register. */ \
    false,                 /* Disabled to invert the scan result bit. */                              \
    false,                 /* Disabled to store counter value in the result buffer. */                \
    lesenseClkLF,          /* Use the LF clock for excitation timing. */                              \
    lesenseClkLF,          /* Use the LF clock for sample timing. */                                  \
    0x03U,                 /* Excitation time is set to 3(+1) excitation clock cycles. */             \
    0x09U,                 /* Sample delay is set to 9(+1) sample clock cycles. */                    \
    0x06U,                 /* Measure delay is set to 6 excitation clock cycles.*/                    \
    0x00U,                 /* ACMP threshold has been set to 0. */                                    \
    lesenseSampleModeACMP, /* ACMP output will be used in comparison. */                              \
    lesenseSetIntNone,     /* No interrupt is generated by the channel. */                            \
    0xFFU,                 /* Counter threshold has bee set to 0xFF. */                               \
    lesenseCompModeLess    /* Compare mode has been set to trigger interrupt on "less". */            \
  }

